app/views/shared/_content_page.html.erb

      end
    end unless @page.nil? or @page.parts.blank?
---
SELECT "page_parts".* FROM "page_parts" WHERE ("page_parts".page_id = 1) ORDER BY position ASC